// ?задача 1
// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().

// *Варіант 1
// const number = +prompt("Введіть число");

// if (number === 10) {
//   alert("Вірно");
// } else {
//   alert("Невірно");
// }

// *Варіант 2
// const number = Number(prompt("Введіть число"));

// if (number === 10) {
//   alert("Вірно");
// } else {
//   alert("Невірно");
// }

// *Варіант 3
// number === 10 ? alert("Вірно") : alert("Невірно");

// ?задача 2
// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад: "10 входить в першу чверть"

// *
// const min = Math.floor(Math.random() * (59 - 0) + 0);

// if (min <= 15) {
//   alert(`${min} входить у першу чверть`);
// } else if (min >= 16 && min <= 30) {
//   alert(`${min} входить у другу чверть`);
// } else if (min >= 31 && min <= 45) {
//   alert(`${min} входить у третю чверть`);
// } else {
//   alert(`${min} входить у четверту чверть`);
// }

// ?задача 3
// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).

// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

// const num = +prompt("Введіть число: 1, 2, 3, 4");

// switch (num) {
//   case 1:
//     alert("Зима");
//     break;
//   case 2:
//     alert("весна");
//     break;
//   case 3:
//     alert("Літо");
//     break;
//   case 4:
//     alert("Осінь");
//     break;
//   default:
//     alert("Вибачте, але ви маєте ввести значення від 1 до 4 включно");
// }

// !завдання 4
// Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'):
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples

// const num = +prompt();

// !Завдання 5:
// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"

// *

// *
// const login = prompt("Напиши свій логін");

// !Завдання 6:
// Використайте цикл while, щоб вивести в console всі числа від 0 до 20 включно.

// ?Завдання 7:
// Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.

// function getNumbers(min, max) {
//   let sum = 0;

//   for (let i = max; i >= min; i--) {
// console.log(i);
//     if (i % 2 === 0) {
//       sum += i;
//     }
//   }
//   return sum;
// }

// console.log(getNumbers(5, 25));

// ?Завдання 8:
// Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// повертати з функції рядок - 'Not a number!'.

// *
// function min(a, b) {
//   if (typeof a !== "number" || typeof b !== "number") {
//     return "Not a number!";
//   }

//   return a < b ? a : b;
// }

// console.log(min(10, -5));
// console.log(min("5", 2));

// *
// function min(a, b) {
//   if (typeof a !== "number" || typeof b !== "number") {
//     return "Not a number!";
//   } else if (a < b) {
//     return a;
//   } else {
//     return b;
//   }
// }

// console.log(min(10, -5));
// console.log(min("5", 2));

// ?Завдання 9:
// Напишіть функцію isAdult(age), яка  приймає число - вік користувача і повертає true,
// якщо параметр age більше чи дорівнює 18.
// В іншому випадку вона запитує підтвердження через confirm
// і повертає його результат (true/false).

// *
// function isAdult(age) {
//   if (age >= 18) {
//     return true;
//   } else {
//     return confirm("confirm your age");
//   }
// }

// console.log(isAdult(17));
// console.log(isAdult(19));

// ?Завдання 10:
// Напишіть функцію fizzBuzz(num), яка приймає число і перевіряє кожне число від 1 до num:
// Якщо число ділитися  без остачі на 3 - виводить в консоль 'fizz',
// якщо ділиться  без остачі на 5 - виводить в консоль 'buzz',
// якщо ділиться  без остачі і на 3, і на 5 - виводить в консоль 'fizzbuzz'.

// function fizzBuzz(num) {
//   for (let i = 1; i <= num; i++) {
//     if (i % 3 === 0 && i % 5 === 0) {
//       console.log("fizz");
//     } else if (i % 5 === 0) {
//       console.log("buzz");
//     } else if (i % 3 === 0) {
//       console.log("fizzbuzz");
//     }
//   }
// }

// fizzBuzz(5);
// fizzBuzz(6);
// fizzBuzz(30);
